{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "User_Input"}, "registered_name": null, "name": "User_Input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Movie_Input"}, "registered_name": null, "name": "Movie_Input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "User_Embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 611, "output_dim": 40, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "User_Embedding", "inbound_nodes": [[["User_Input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "Movie_Embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 193610, "output_dim": 40, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "Movie_Embedding", "inbound_nodes": [[["Movie_Input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "User_Vector", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 1, 40]}, "name": "User_Vector", "inbound_nodes": [[["User_Embedding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "Movie_Vector", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 1, 40]}, "name": "Movie_Vector", "inbound_nodes": [[["Movie_Embedding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "Concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 40], [null, 40]]}, "name": "Concatenate", "inbound_nodes": [[["User_Vector", 0, 0, {}], ["Movie_Vector", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 80]}, "name": "dense", "inbound_nodes": [[["Concatenate", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "Output", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 100]}, "name": "Output", "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["User_Input", 0, 0], ["Movie_Input", 0, 0]], "output_layers": [["Output", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}